import { About } from './About';

export const mockedAbout: About = {
  selfIntroduction: `こんにちは、そのへんにいる一般エンジニア「にらんけん」です。
  普段はWebエンジニアとして働いています。
  プログラミング歴は独学(研究室時代)3年 + 社会人(Webエンジニア)4年で、なんだかんだで7年くらいやってます。

  最近の興味ごと(課題に思っていること)は「開発者の開発体験を良くすること」で、
  アプリケーション開発だけでなく、CI/CDや古くなった開発環境の改善などに力を入れてます。
  みかん箱の上で開発するのはストレスだ！(みかん箱であることに気づかないことも多い)といつも心で唱えてます。
  もし個人で開発していたら、自分が開発しやすい環境を整えるはずです。

  定期的なアウトプットの機会として、隔週でお遊びプログラムや勉強した内容を動画化する取り組みを始めており、
  #4として本ポートフォリオを作ってます。半分自己満足ですが、おかげで休日に時間をとって楽しく勉強できています。
  `,
};
