import { About } from './About';

export const mockedAbout: About = {
  selfIntroduction: `こんにちは、「にらんけん」です。
  普段はWebエンジニアとして働いています。
  プログラミング歴は独学(研究室時代)3年 + 社会人(Webエンジニア)4年で、なんだかんだで7年くらいです。
  教員免許(高校1種)も持っており、アナログの多い教育方面での貢献も何かできないかと画策しています。

  最近の興味ごと(課題に思っていること)は「開発者の開発体験を良くすること」で、
  アプリケーション開発だけでなく、CI/CDや古くなった開発環境の改善などに力を入れてます。
  現状の環境に妥協せず、こうしたらもっとチームのみんな開発しやすくなるんじゃないかなーとか、
  どうせなら開発者みんながどんどん能動的に動けるような環境つくりたいなーとか、考えながら仕事やってます。

  定期的なアウトプットの機会として、隔週目標でお遊びプログラムや勉強した内容を動画投稿する取り組みを始めており、
  #4として本ポートフォリオを作ってます。半分自己満足ですが、おかげで休日にちょっとずつ時間をとって勉強できています。
  `,
};
